; ModuleID = 'test_tc_neigh.c'
source_filename = "test_tc_neigh.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2, i32 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0, i32, i32 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32, i32 }
%struct.bpf_redir_neigh = type { i32, %union.anon.4 }
%union.anon.4 = type { [4 x i32] }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon.3 }
%union.anon.3 = type { [4 x i32] }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }

@ifindex_map = dso_local global %struct.bpf_map_def { i32 2, i32 4, i32 4, i32 2, i32 0 }, section "maps", align 4, !dbg !0
@bpf_skb_store_bytes = internal global i64 (%struct.__sk_buff*, i32, i8*, i32, i64)* inttoptr (i64 9 to i64 (%struct.__sk_buff*, i32, i8*, i32, i64)*), align 8, !dbg !76

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ifindex_map", scope: !2, file: !3, line: 41, type: !198, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.0-1ubuntu1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !10, globals: !71, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "test_tc_neigh.c", directory: "/home/cloudcome/bpf/tc")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 36, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "dev_src", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "dev_dst", value: 1, isUnsigned: true)
!10 = !{!11, !12, !13, !15, !38}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !14, line: 27, baseType: !6)
!14 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !17, line: 86, size: 160, elements: !18)
!17 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!18 = !{!19, !22, !23, !24, !29, !30, !31, !32, !33, !35, !37}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !16, file: !17, line: 88, baseType: !20, size: 4, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !14, line: 21, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !16, file: !17, line: 89, baseType: !20, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !16, file: !17, line: 96, baseType: !20, size: 8, offset: 8)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !16, file: !17, line: 97, baseType: !25, size: 16, offset: 16)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !26, line: 25, baseType: !27)
!26 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !14, line: 24, baseType: !28)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !16, file: !17, line: 98, baseType: !25, size: 16, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !16, file: !17, line: 99, baseType: !25, size: 16, offset: 48)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !16, file: !17, line: 100, baseType: !20, size: 8, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !16, file: !17, line: 101, baseType: !20, size: 8, offset: 72)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !16, file: !17, line: 102, baseType: !34, size: 16, offset: 80)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !26, line: 31, baseType: !27)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !16, file: !17, line: 103, baseType: !36, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !26, line: 27, baseType: !13)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !16, file: !17, line: 104, baseType: !36, size: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !40, line: 117, size: 320, elements: !41)
!40 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!41 = !{!42, !43, !44, !48, !49, !50, !51, !70}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !39, file: !40, line: 119, baseType: !20, size: 4, flags: DIFlagBitField, extraData: i64 0)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !39, file: !40, line: 120, baseType: !20, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !39, file: !40, line: 127, baseType: !45, size: 24, offset: 8)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !39, file: !40, line: 129, baseType: !25, size: 16, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !39, file: !40, line: 130, baseType: !20, size: 8, offset: 48)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !39, file: !40, line: 131, baseType: !20, size: 8, offset: 56)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !39, file: !40, line: 133, baseType: !52, size: 128, offset: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !53, line: 33, size: 128, elements: !54)
!53 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !52, file: !53, line: 40, baseType: !56, size: 128)
!56 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !52, file: !53, line: 34, size: 128, elements: !57)
!57 = !{!58, !62, !66}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !56, file: !53, line: 35, baseType: !59, size: 128)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !56, file: !53, line: 37, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !56, file: !53, line: 38, baseType: !67, size: 128)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !39, file: !40, line: 134, baseType: !52, size: 128, offset: 192)
!71 = !{!0, !72, !76, !179, !193}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 149, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !68)
!75 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !78, line: 220, type: !79, isLocal: true, isDefinition: true)
!78 = !DIFile(filename: "../libbpf/src/bpf_helper_defs.h", directory: "/home/cloudcome/bpf/tc")
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!12, !82, !13, !177, !13, !149}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !84, line: 4183, size: 1472, elements: !85)
!84 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !102, !103, !104, !105, !106, !107, !108, !109, !110, !112, !113, !114, !115, !116, !148, !151, !152, !153, !176}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, file: !84, line: 4184, baseType: !13, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !83, file: !84, line: 4185, baseType: !13, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !83, file: !84, line: 4186, baseType: !13, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !83, file: !84, line: 4187, baseType: !13, size: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !83, file: !84, line: 4188, baseType: !13, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !83, file: !84, line: 4189, baseType: !13, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !83, file: !84, line: 4190, baseType: !13, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !83, file: !84, line: 4191, baseType: !13, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !83, file: !84, line: 4192, baseType: !13, size: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !83, file: !84, line: 4193, baseType: !13, size: 32, offset: 288)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !83, file: !84, line: 4194, baseType: !13, size: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !83, file: !84, line: 4195, baseType: !13, size: 32, offset: 352)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !83, file: !84, line: 4196, baseType: !99, size: 160, offset: 384)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 5)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !83, file: !84, line: 4197, baseType: !13, size: 32, offset: 544)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !83, file: !84, line: 4198, baseType: !13, size: 32, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !84, line: 4199, baseType: !13, size: 32, offset: 608)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !83, file: !84, line: 4200, baseType: !13, size: 32, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !83, file: !84, line: 4201, baseType: !13, size: 32, offset: 672)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !83, file: !84, line: 4204, baseType: !13, size: 32, offset: 704)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !83, file: !84, line: 4205, baseType: !13, size: 32, offset: 736)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !83, file: !84, line: 4206, baseType: !13, size: 32, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !83, file: !84, line: 4207, baseType: !111, size: 128, offset: 800)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 128, elements: !68)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !83, file: !84, line: 4208, baseType: !111, size: 128, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !83, file: !84, line: 4209, baseType: !13, size: 32, offset: 1056)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !83, file: !84, line: 4210, baseType: !13, size: 32, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !83, file: !84, line: 4213, baseType: !13, size: 32, offset: 1120)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !83, file: !84, line: 4214, baseType: !117, size: 64, align: 64, offset: 1152)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !84, line: 4214, size: 64, align: 64, elements: !118)
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !117, file: !84, line: 4214, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !84, line: 5041, size: 448, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !146, !147}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !121, file: !84, line: 5042, baseType: !27, size: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !121, file: !84, line: 5043, baseType: !27, size: 16, offset: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !121, file: !84, line: 5044, baseType: !27, size: 16, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !121, file: !84, line: 5045, baseType: !20, size: 8, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !121, file: !84, line: 5046, baseType: !20, size: 8, offset: 56)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !121, file: !84, line: 5047, baseType: !20, size: 8, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !121, file: !84, line: 5048, baseType: !20, size: 8, offset: 72)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !121, file: !84, line: 5049, baseType: !25, size: 16, offset: 80)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !121, file: !84, line: 5050, baseType: !25, size: 16, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !121, file: !84, line: 5051, baseType: !25, size: 16, offset: 112)
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !84, line: 5052, baseType: !134, size: 256, offset: 128)
!134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !84, line: 5052, size: 256, elements: !135)
!135 = !{!136, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !84, line: 5053, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !134, file: !84, line: 5053, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !137, file: !84, line: 5054, baseType: !36, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !137, file: !84, line: 5055, baseType: !36, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !134, file: !84, line: 5057, baseType: !142, size: 256)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !134, file: !84, line: 5057, size: 256, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !142, file: !84, line: 5058, baseType: !111, size: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !142, file: !84, line: 5059, baseType: !111, size: 128, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !84, line: 5062, baseType: !13, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !121, file: !84, line: 5063, baseType: !36, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !83, file: !84, line: 4215, baseType: !149, size: 64, offset: 1216)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !14, line: 31, baseType: !150)
!150 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !83, file: !84, line: 4216, baseType: !13, size: 32, offset: 1280)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !83, file: !84, line: 4217, baseType: !13, size: 32, offset: 1312)
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !83, file: !84, line: 4218, baseType: !154, size: 64, align: 64, offset: 1344)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !83, file: !84, line: 4218, size: 64, align: 64, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !154, file: !84, line: 4218, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !84, line: 4272, size: 640, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !158, file: !84, line: 4273, baseType: !13, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !158, file: !84, line: 4274, baseType: !13, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !158, file: !84, line: 4275, baseType: !13, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !158, file: !84, line: 4276, baseType: !13, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !158, file: !84, line: 4277, baseType: !13, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !158, file: !84, line: 4278, baseType: !13, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !158, file: !84, line: 4280, baseType: !13, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !158, file: !84, line: 4281, baseType: !111, size: 128, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !158, file: !84, line: 4282, baseType: !13, size: 32, offset: 352)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !158, file: !84, line: 4283, baseType: !13, size: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !158, file: !84, line: 4284, baseType: !13, size: 32, offset: 416)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !158, file: !84, line: 4285, baseType: !111, size: 128, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !158, file: !84, line: 4286, baseType: !13, size: 32, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !158, file: !84, line: 4287, baseType: !174, size: 32, offset: 608)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !14, line: 26, baseType: !175)
!175 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !83, file: !84, line: 4219, baseType: !13, size: 32, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "bpf_redirect_neigh", scope: !2, file: !78, line: 3588, type: !181, isLocal: true, isDefinition: true)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!12, !13, !184, !175, !149}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_redir_neigh", file: !84, line: 5016, size: 160, elements: !186)
!186 = !{!187, !188}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nh_family", scope: !185, file: !84, line: 5018, baseType: !13, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !185, file: !84, line: 5020, baseType: !189, size: 128, offset: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !185, file: !84, line: 5020, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_nh", scope: !189, file: !84, line: 5021, baseType: !36, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_nh", scope: !189, file: !84, line: 5022, baseType: !111, size: 128)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !78, line: 49, type: !195, isLocal: true, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!11, !11, !177}
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !199, line: 138, size: 160, elements: !200)
!199 = !DIFile(filename: "../libbpf/src/bpf_helpers.h", directory: "/home/cloudcome/bpf/tc")
!200 = !{!201, !202, !203, !204, !205}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !199, line: 139, baseType: !6, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !198, file: !199, line: 140, baseType: !6, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !198, file: !199, line: 141, baseType: !6, size: 32, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !198, file: !199, line: 142, baseType: !6, size: 32, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !198, file: !199, line: 143, baseType: !6, size: 32, offset: 128)
!206 = !{i32 7, !"Dwarf Version", i32 4}
!207 = !{i32 2, !"Debug Info Version", i32 3}
!208 = !{i32 1, !"wchar_size", i32 4}
!209 = !{!"Ubuntu clang version 12.0.0-1ubuntu1"}
!210 = distinct !DISubprogram(name: "tc_chk", scope: !3, file: !3, line: 89, type: !211, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!175, !82}
!213 = !{}
!214 = !DILocalVariable(name: "skb", arg: 1, scope: !210, file: !3, line: 89, type: !82)
!215 = !DILocation(line: 89, column: 48, scope: !210)
!216 = !DILocalVariable(name: "data_end", scope: !210, file: !3, line: 91, type: !11)
!217 = !DILocation(line: 91, column: 8, scope: !210)
!218 = !DILocation(line: 91, column: 19, scope: !210)
!219 = !DILocalVariable(name: "data", scope: !210, file: !3, line: 92, type: !11)
!220 = !DILocation(line: 92, column: 8, scope: !210)
!221 = !DILocation(line: 92, column: 15, scope: !210)
!222 = !DILocalVariable(name: "raw", scope: !210, file: !3, line: 93, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!224 = !DILocation(line: 93, column: 9, scope: !210)
!225 = !DILocation(line: 93, column: 15, scope: !210)
!226 = !DILocation(line: 95, column: 6, scope: !227)
!227 = distinct !DILexicalBlock(scope: !210, file: !3, line: 95, column: 6)
!228 = !DILocation(line: 95, column: 11, scope: !227)
!229 = !DILocation(line: 95, column: 37, scope: !227)
!230 = !DILocation(line: 95, column: 35, scope: !227)
!231 = !DILocation(line: 95, column: 6, scope: !210)
!232 = !DILocation(line: 96, column: 3, scope: !227)
!233 = !DILocation(line: 98, column: 10, scope: !210)
!234 = !DILocation(line: 98, column: 17, scope: !210)
!235 = !DILocation(line: 98, column: 21, scope: !210)
!236 = !DILocation(line: 98, column: 28, scope: !210)
!237 = !DILocation(line: 98, column: 32, scope: !210)
!238 = !DILocation(line: 98, column: 31, scope: !210)
!239 = !DILocation(line: 0, scope: !210)
!240 = !DILocation(line: 98, column: 9, scope: !210)
!241 = !DILocation(line: 98, column: 2, scope: !210)
!242 = !DILocation(line: 99, column: 1, scope: !210)
!243 = distinct !DISubprogram(name: "tc_dst", scope: !3, file: !3, line: 101, type: !211, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !213)
!244 = !DILocalVariable(name: "skb", arg: 1, scope: !243, file: !3, line: 101, type: !82)
!245 = !DILocation(line: 101, column: 49, scope: !243)
!246 = !DILocalVariable(name: "zero", scope: !243, file: !3, line: 103, type: !247)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 96, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 12)
!250 = !DILocation(line: 103, column: 7, scope: !243)
!251 = !DILocalVariable(name: "redirect", scope: !243, file: !3, line: 104, type: !252)
!252 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!253 = !DILocation(line: 104, column: 7, scope: !243)
!254 = !DILocation(line: 106, column: 10, scope: !243)
!255 = !DILocation(line: 106, column: 15, scope: !243)
!256 = !DILocation(line: 106, column: 2, scope: !243)
!257 = !DILocation(line: 108, column: 30, scope: !258)
!258 = distinct !DILexicalBlock(scope: !243, file: !3, line: 106, column: 25)
!259 = !DILocalVariable(name: "skb", arg: 1, scope: !260, file: !3, line: 48, type: !82)
!260 = distinct !DISubprogram(name: "is_remote_ep_v4", scope: !3, file: !3, line: 48, type: !261, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !213)
!261 = !DISubroutineType(types: !262)
!262 = !{!252, !82, !36}
!263 = !DILocation(line: 48, column: 63, scope: !260, inlinedAt: !264)
!264 = distinct !DILocation(line: 108, column: 14, scope: !258)
!265 = !DILocalVariable(name: "addr", arg: 2, scope: !260, file: !3, line: 49, type: !36)
